{
  "pets": [
    {
      "id": 1,
      "breed": "Airedale Terrier",
      "species": "dog",
      "averageLifespan": 12,
      "averageWeight": 60,
      "coatLength": "medium",
      "colors": ["brown", "black"],
      "tailLength": "medium",
      "characteristics": ["friendly", "courageous", "smart"],
      "picture": "/../public/Airedale-Terrier-dog.jpg",
      "description": "The Airedale Terrier is the largest of all terrier breeds. Males stand about 23 inches at the shoulder, females a little less. The dense, wiry coat is tan with black markings. Long, muscular legs give Airedales a regal lift in their bearing, and the long head with its sporty beard and mustache, dark eyes, and neatly folded ears conveys a keen intelligence. Airedales are the very picture of an alert and willing terrier only bigger. And, like his smaller cousins in the terrier family, he can be bold, determined, and stubborn. Airedales are docile and patient with kids but won't back down when protecting hearth and home. Thanks to their famous do-it-all attitude, Airedales excel in all kinds of sports and family activities."
    },
    {
      "id": 2,
      "breed": "Boxer",
      "species": "dog",
      "averageLifespan": 11,
      "averageWeight": 60,
      "coatLength": "short",
      "colors": ["white", "fawn", "brindle", "white"],
      "tailLength": "short",
      "characteristics": ["active", "smart", "playful", "silly"],
      "picture": "/../public/Boxer-dog.jpg",
      "description": "Loyalty, affection, intelligence, work ethic, and good looks: Boxers are the whole doggy package. Bright and alert, sometimes silly, but always courageous, the Boxer has been among America's most popular dog breeds for a very long time. A well-made Boxer in peak condition is an awesome sight. A male can stand as high as 25 inches at the shoulder; females run smaller. Their muscles ripple beneath a short, tight-fitting coat. The dark brown eyes and wrinkled forehead give the face an alert, curious look. The coat can be fawn or brindle, with white markings. Boxers move like the athletes they are named for: smooth and graceful, with a powerful forward thrust. Boxers are upbeat and playful. Their patience and protective nature have earned them a reputation as a great dog with children. They take the jobs of watchdog and family guardian seriously and will meet threats fearlessly. Boxers do best when exposed to a lot of people and other animals in early puppyhood."
    },
    {
      "id": 3,
      "breed": "Chihuahua",
      "species": "dog",
      "averageLifespan": 15,
      "averageWeight": 6,
      "coatLength": "short",
      "colors": ["black", "white", "fawn", "chocolate", "cream", "gold"],
      "tailLength": "medium",
      "characteristics": ["charming", "graceful", "sassy", "barky", "shaky"],
      "picture": "/../public/Chihuahua-dog.jpg",
      "description": "The Chihuahua is a tiny dog with a huge personality. A national symbol of Mexico, these alert and amusing \"purse dogs\" stand among the oldest breeds of the Americas, with a lineage going back to the ancient kingdoms of pre-Columbian times. The Chihuahua is a balanced, graceful dog of terrier-like demeanor, weighing no more than 6 pounds. The rounded \"apple\" head is a breed hallmark. The erect ears and full, luminous eyes are acutely expressive. Coats come in many colors and patterns, and can be long or short. The varieties are identical except for coat.Chihuahuas possess loyalty, charm, and big-dog attitude. Even tiny dogs require training, and without it this clever scamp will rule your household like a little Napoleon. Compact and confident, Chihuahuas are ideal city pets. They are too small for roughhousing with kids, and special care must be taken in cold weather, but Chihuahuas are adaptable as long as they get lots of quality time in their preferred lap."
    },
    {
      "id": 4,
      "breed": "Dalmatian",
      "species": "dog",
      "averageLifespan": 12,
      "averageWeight": 55,
      "coatLength": "short",
      "colors": ["white", "black"],
      "tailLength": "long",
      "characteristics": ["dignified", "outgoing", "smart"],
      "picture": "/../public/Dalmatian-dog.jpg",
      "description": "The dignified Dalmatian, dogdom's citizen of the world, is famed for his spotted coat and unique job description. During their long history, these \"coach dogs\" have accompanied the horse-drawn rigs of nobles, gypsies, and firefighters. The Dalmatian's delightful, eye-catching spots of black or liver adorn one of the most distinctive coats in the animal kingdom. Beneath the spots is a graceful, elegantly proportioned trotting dog standing between 19 and 23 inches at the shoulder. Dals are muscular, built to go the distance; the powerful hindquarters provide the drive behind the smooth, effortless gait. The Dal was originally bred to guard horses and coaches, and some of the old protective instinct remains. Reserved and dignified, Dals can be aloof with strangers and are dependable watchdogs. With their preferred humans, Dals are bright, loyal, and loving house dogs. They are strong, active athletes with great stamina and wonderful partner for runners and hikers."
    },
    {
      "id": 5,
      "breed": "English Setter",
      "species": "dog",
      "averageLifespan": 12,
      "averageWeight": 60,
      "coatLength": "medium",
      "colors": [
        "blue beltson",
        "tri-color",
        "orange belton",
        "liver belton",
        "lemon belton",
        "chestnut belton"
      ],
      "tailLength": "long",
      "characteristics": ["friendly", "mellow", "merry"],
      "picture": "/../public/English-Setter-dog.jpg",
      "description": "The English Setter is a medium-sized sporting dog of sweet temper and show-stopping good looks. It is one of the AKC's four British setters created to work on the distinctly different terrains of England, Ireland, and Scotland. English Setters are elegant but solid dogs of beauty and charm. The word 'belton,' unique to the breed, describes the speckled coat patterns of colors that sound good enough to eat: liver, lemon, and orange among them. Under the showy coat is a well-balanced hunter standing about 25 inches at the shoulder. A graceful neck carries a long, oval-shaped head proudly, and dark brown eyes convey a soft expression. The merry English Setter is known as the gentleman of the dog world but is game and boisterous at play. English Setters get on well with other dogs and people. A veteran all-breed dog handler says, 'As a breed to share one's life and living space with, no other breed gives me more pleasure than the English Setter.'"
    },
    {
      "id": 6,
      "breed": "French Bulldog",
      "species": "dog",
      "averageLifespan": 11,
      "averageWeight": 25,
      "coatLength": "short",
      "colors": ["white", "brindle", "fawn", "tan"],
      "tailLength": "short",
      "characteristics": ["playful", "smart", "adaptable", "hefty"],
      "picture": "/../public/French-Bulldog-dog.jpg",
      "description": "The one-of-a-kind French Bulldog, with his large bat ears and even disposition, is one of the world's most popular small-dog breeds, especially among city dwellers. The Frenchie is playful, alert, adaptable, and completely irresistible. The French Bulldog resembles a Bulldog in miniature, except for the large, erect 'bat ears' that are the breed's trademark feature. The head is large and square, with heavy wrinkles rolled above the extremely short nose. The body beneath the smooth, brilliant coat is compact and muscular. The bright, affectionate Frenchie is a charmer. Dogs of few words, Frenchies don't bark much, but their alertness makes them excellent watchdogs. They happily adapt to life with singles, couples, or families, and do not require a lot of outdoor exercise. They get on well with other animals and enjoy making new friends of the human variety. It is no wonder that city folk from Paris to Peoria swear by this vastly amusing and companionable breed."
    },
    {
      "id": 7,
      "breed": "German Shepherd",
      "species": "dog",
      "averageLifespan": 8,
      "averageWeight": 70,
      "coatLength": "long",
      "colors": ["black", "tan", "sable", "red", "silver"],
      "tailLength": "long",
      "characteristics": ["courageous", "smart", "confident"],
      "picture": "/../public/German-Shepherd-dog.jpg",
      "description": "Generally considered dogkind's finest all-purpose worker, the German Shepherd Dog is a large, agile, muscular dog of noble character and high intelligence. Loyal, confident, courageous, and steady, the German Shepherd is truly a dog lover's delight. German Shepherd Dogs can stand as high as 26 inches at the shoulder and, when viewed in outline, presents a picture of smooth, graceful curves rather than angles. The natural gait is a free-and-easy trot, but they can turn it up a notch or two and reach great speeds. There are many reasons why German Shepherds stand in the front rank of canine royalty, but experts say their defining attribute is character: loyalty, courage, confidence, the ability to learn commands for many tasks, and the willingness to put their life on the line in defense of loved ones. German Shepherds will be gentle family pets and steadfast guardians, but, the breed standard says, there's a 'certain aloofness that does not lend itself to immediate and indiscriminate friendships.'"
    },
    {
      "id": 8,
      "breed": "Havanese",
      "species": "dog",
      "averageLifespan": 15,
      "averageWeight": 10,
      "coatLength": "long",
      "colors": ["black", "white", "brown", "fawn"],
      "tailLength": "medium",
      "characteristics": ["smart", "outgoing", "funny"],
      "picture": "/../public/Havanese-dog.jpg",
      "description": "Havanese, the only dog breed native to Cuba, are cheerful little dogs with a spring in their step and a gleam in their big, brown eyes. These vivacious and sociable companions are becoming especially popular with American city dwellers. Distinctive features of the Havanese include a curled-over tail and a gorgeous silky coat, which comes in a variety of colors. Some owners enjoy cording the coat, in the manner of a Puli, and others clip it short to reduce grooming time. Happily, Havenese are just as cute no matter what hairdo you give them. Their small but sturdy bodies, adaptable nature, and social skills make Havanese an ideal city dog, but they are content to be anywhere that they can command the attention of admirers young and old alike. Havanese, smart and trainable extroverts with the comic instincts of a born clown, are natural trick dogs. Havanese are also excellent watchdogs and take the job seriously, but will usually keep the barking to a minimum."
    },
    {
      "id": 9,
      "breed": "Italian Greyhound",
      "species": "dog",
      "averageLifespan": 14,
      "averageWeight": 10,
      "coatLength": "short",
      "colors": [
        "black",
        "fawn",
        "blue",
        "chocolate",
        "tan",
        "sable",
        "red",
        "gray",
        "yellow"
      ],
      "tailLength": "long",
      "characteristics": ["alert", "playful", "sensitive"],
      "picture": "/../public/Italian-Greyhound-dog.jpg",
      "description": "A true Greyhound in miniature, the elegant Italian Greyhound is an alert, playful, and highly affectionate toy companion. IGs make decorative couch dogs, but at heart they are flash-and-dash coursing hounds with an instinct for pursuit. IGs are Greyhounds in miniature form: more slender, but a Greyhound's equal in grace and elegance. Standing ideally 13 to 15 inches at the shoulder, they present the sleek, curving lines common to all coursing hounds. Distinguishing features are the long, fine-boned legs. IGs combine the attentiveness of lapdogs with the complexity of ancient, aristocratic hounds. Bred for centuries to be doting companions and jesters, these high-stepping charmers refuse to be ignored. 'On the whole,' writes an IG expert, 'the breed would much rather be in your lap or bed than on the floor.' They are, though, true sighthounds and will bolt after quick-moving prey at the drop of a cat. A short-coat, low-fat breed, IGs require extra care in cold weather."
    },
    {
      "id": 10,
      "breed": "Japanese Chin",
      "species": "dog",
      "averageLifespan": 11,
      "averageWeight": 9,
      "coatLength": "long",
      "colors": ["black", "white", "tri-color", "lemon", "red", "sable"],
      "tailLength": "short",
      "characteristics": ["charming", "loving", "noble"],
      "picture": "/../public/Japanese-Chin-dog.jpg",
      "description": "The Japanese Chin is a charming toy companion of silky, profuse coat and an unmistakably aristocratic bearing. Often described as a distinctly 'feline' breed, this bright and amusing lapdog is fastidious, graceful, and generally quiet. Chin are the unrivaled noblemen of Japanese breeds. They're tiny 'indoorsy' companions, with an unmistakably Eastern look and bearing. The head is large, the muzzle short, and the round, dark eyes convey, as Chin fans like to say, a 'look of astonishment.' The profuse mane around the neck and shoulders, the plumed tail arching over the back, and the pants or 'culottes' on the hind legs project the elegant, exotic appearance so typical of Asia's royal line of laptop cuddle bugs."
    },
    {
      "id": 11,
      "breed": "Abyssinian",
      "species": "cat",
      "averageLifespan": 13,
      "averageWeight": 8,
      "coatLength": "medium",
      "colors": ["red", "blue", "fawn"],
      "tailLength": "long",
      "characteristics": ["smart", "curious", "independent"],
      "picture": "/../public/Abyssinian-cat.jpg",
      "description": "Whilst not a lap-cat, as this is not a feline to curl up and relax much, the Abyssinian is a very friendly, curious and inquisitive cat, who will delight in helping or supervising any activity you happen to be involved in. Owners will need to actively enjoy and be amused by a cat who wishes to get involved in household tasks, and be ready to play lengthy games to keep this cat happy and satisfied with life. Described as intensely loyal and playful, this is a cat who will require owners who are at home a lot of the time, you do not want an Abyssinian to amuse themselves without supervision!"
    },
    {
      "id": 12,
      "breed": "Bengal",
      "species": "cat",
      "averageLifespan": 14,
      "averageWeight": 12,
      "coatLength": "medium",
      "colors": ["orange", "brown", "marble"],
      "tailLength": "long",
      "characteristics": ["confident", "curious", "playful"],
      "picture": "/../public/Bengal-cat.jpg",
      "description": "Bengals make fabulous pets for experienced cat owners who love an active, curious and dog-like cat - and can keep them entertained with toys, games and plenty of environmental enrichment. No matter their appeal, if you are after a cat who lies around looking decorative and stays out of the way, the Bengal is not for you! They are into everything, highly amused by simple things such as a dripping tap or flowing water (watch them for knocking your water glass over to see the water spill!), they adore human company and will play for hours if you are willing - and even if you aren’t! This is not really a lap cat; they are simply too busy with stuff and things to want to settle on your lap for long. Although not typically a noisy cat, the Bengal is capable of a loud and strident cry when things are not going their way or they feel they are lacking attention."
    },
    {
      "id": 13,
      "breed": "Cornish Rex",
      "species": "cat",
      "averageLifespan": 12,
      "averageWeight": 7,
      "coatLength": "short",
      "colors": [
        "white",
        "black",
        "blue",
        "red",
        "cream",
        "chocolate",
        "lavender"
      ],
      "tailLength": "long",
      "characteristics": ["active", "playful", "spooky"],
      "picture": "/../public/CornishRex-cat.jpg",
      "description": "Playful and kittenish into old age, the Cornish Rex has been described as the Greyhound of the cat world. Lean and athletic, with a characteristic galloping run, it is easy to see how this comparison can be drawn. Cornish Rex’s are clever, adventurous and extremely curious. They are also highly sociable with both people and other household pets."
    },
    {
      "id": 14,
      "breed": "Exotic Shorthair",
      "species": "cat",
      "averageLifespan": 15,
      "averageWeight": 10,
      "coatLength": "short",
      "colors": [
        "white",
        "black",
        "blue",
        "red",
        "cream",
        "chocolate",
        "silver"
      ],
      "tailLength": "long",
      "characteristics": ["sweet", "gentle", "frumpy"],
      "picture": "/../public/Exotic-Shorthair-cat.jpg",
      "description": "The Exotic Shorthair is a little more active and playful than their long coated Persian cousins, but this is still a much more relaxed and sedentary cat than the average puss, or the leaner built more athletic cat breeds. Friendly and loving to those they know well but inclined to be a little standoff-ish and selective with strangers, the Exotic Shorthair will enjoy a peaceful home, and doesn’t mind spending time on their own on occasion. As long as meals are delivered regularly and affection is doled out when asked for, the Exotic Shorthair is not a busy, demanding or problem-solving cat."
    },
    {
      "id": 15,
      "breed": "Japanese Bobtail",
      "species": "cat",
      "averageLifespan": 16,
      "averageWeight": 7,
      "coatLength": "long",
      "colors": ["white", "black", "blue", "red", "cream"],
      "tailLength": "short",
      "characteristics": ["lucky", "mischievous", "friendly"],
      "picture": "/../public/JapaneseBobtail-cat.jpg",
      "description": "Playful and fun, curious and bold, the Japanese Bobtail is an engaging cat to spend time with. They love fuss and cuddles, but also like to climb and play and are lean and athletically built. They want to be around people, but are also gregarious and friendly with their own kind and can be introduced to other pets if this is done carefully."
    },
    {
      "id": 16,
      "breed": "Maine Coon",
      "species": "cat",
      "averageLifespan": 12,
      "averageWeight": 12,
      "coatLength": "long",
      "colors": ["brown", "tabby"],
      "tailLength": "long",
      "characteristics": ["gentle", "playful", "friendly"],
      "picture": "/../public/MaineCoon-cat.jpg",
      "description": "Maine Coon cats have an affectionate nature and are very playful and friendly. They enjoy human company and this makes them excellent companions for someone who enjoys sharing their home with such an enormous cat. Maine Coon cats are noted for the delightful quiet chirping sound they make."
    },
    {
      "id": 17,
      "breed": "Manx",
      "species": "cat",
      "averageLifespan": 12,
      "averageWeight": 10,
      "coatLength": "short",
      "colors": ["white", "black", "blue", "red", "cream", "silver"],
      "tailLength": "short",
      "characteristics": ["loving", "playful", "chatty"],
      "picture": "/../public/Manx-cat.jpg",
      "description": "Social, gregarious, and affectionate with people and other pets they know, the Manx cat can be more aloof with strangers. The Manx has a long history as a working cat, expected to pay their way by mousing and ratting, and the modern Manx cat is perfectly capable of fulfilling this role today, with some Manx cats being particularly feisty and keen on their ‘outdoor pursuits’."
    },
    {
      "id": 18,
      "breed": "Munchkin",
      "species": "cat",
      "averageLifespan": 13,
      "averageWeight": 7,
      "coatLength": "short",
      "colors": ["varied"],
      "tailLength": "long",
      "characteristics": ["cute", "playful", "tiny"],
      "picture": "/../public/Munchkin-cat.jpg",
      "description": "If your first thought on meeting a Munchkin is ‘cat-weasel’, you wouldn’t be far wrong. The Munchkin can find it hard to jump (although many can) and they move very differently to standard legged cats, with a much wrigglier, rolling motion. Curious, intelligent, friendly and playful, the Munchkin is in other respects much like any domestic cat, possibly more inclined to enjoy handling and lap-time than some, but equally keen to exercise their feline hunting behaviour by chasing and hunting toys if given the opportunity."
    },
    {
      "id": 19,
      "breed": "Norwegian Forest Cat",
      "species": "cat",
      "averageLifespan": 15,
      "averageWeight": 12,
      "coatLength": "long",
      "colors": ["white", "black", "blue", "red", "cream", "silver"],
      "tailLength": "long",
      "characteristics": ["gentle", "athletic", "independent"],
      "picture": "/../public/NorwegianForestCat-cat.jpg",
      "description": "Gentle and friendly, but not constantly demanding of attention, a Norwegian Forest cat or ‘Wegie’ is happy to entertain themselves if no one is home, and equally satisfied with curling up beside their people when they are there. The Norwegian Forest cat temperament can be somewhat reserved, when it comes to visitors, and are not particularly lap-cats (often because they can be prone to overheating) but will enjoy affection and physical contact from their people."
    },
    {
      "id": 20,
      "breed": "Scottish Fold",
      "species": "cat",
      "averageLifespan": 13,
      "averageWeight": 9,
      "coatLength": "medium",
      "colors": ["white", "black", "blue", "red", "cream", "silver"],
      "tailLength": "long",
      "characteristics": ["smart", "friendly", "loving"],
      "picture": "/../public/SchottishFold-cat.jpg",
      "description": "The Scottish Fold’s ancestry lies with farm cats, and as you may imagine, a Scottish farm cat needed to be a rugged and hardy animal. Although the show example has come a long way since those days, this is still a robust, tough natured cat. They are easily adaptable to most situations, not worried about loud or busy homes but equally at home in a quiet, single person’s abode. They are said to have a sweet disposition and a tiny voice which is used very rarely."
    },
    {
      "id": 21,
      "breed": "Tardar Sauce (mixed breed)",
      "species": "cat",
      "averageLifespan": "Forever in our hearts",
      "averageWeight": 9,
      "coatLength": "medium",
      "colors": ["white", "black", "cream", "silver", "brown"],
      "tailLength": "medium",
      "characteristics": ["famous", "tiny", "grumpy", "cute"],
      "picture": "/../public/Tardar-Sauce-cat.jpg",
      "description": "Tardar Sauce (April 4, 2012 - May 14, 2019), nicknamed Grumpy Cat, was an American Internet celebrity cat. She was known for her permanently \"grumpy\" facial appearance, which was caused by an underbite and feline dwarfism. She came to prominence when a photograph of her was posted on September 22, 2012, on social news website Reddit by Bryan Bundesen, the brother of her owner Tabatha Bundesen. \"Lolcats\" and parodies created from the photograph by Reddit users became popular. She was the subject of a popular Internet meme in which humorously negative, cynical images were made from photographs of her. As of August 23, 2020, Grumpy Cat had 8.3 million total likes on Facebook, 2.6 million followers on Instagram, 1.5 million followers on Twitter, and 283,000 subscribers on YouTube."
    }
  ]
}
